# Запуск программы

1. Запуск nodejs решения:  
  Для запуска данного решения необходим установленный nodeJS.
  ```sh
  node ./nodejs/main.js
  ```
2. Запуск python решения:  
  Для запуска python решения необходим установленный интепретатор python3
  ```sh
  python ./python/main.py
  ```

# Описание задачи

Написать программу на любом языке программирования, которая поместит + (2+3), - (3-2), или ничего ( ) в промежутках между цифрами от 9 до 0 (в таком порядке) так, чтобы в результате получилось 200. Например: 98+76-5+43-2-10=200.
___

# Описание решения

1. Создаем основные массивы (массив цифр от 9 до 0, массив допустимых операций, всевозможные комбинации операций между цифрами (+, - или ничего, то есть 2е и более цифры соединяются и получается 2х и более значное число, например 321), таких комбинаций 3^9).
2. Для каждой из комбинации (+++++++++ или ++++++++- и тд)
3. Вычисляем результат данной строки (в python для этого есть eval, как и во многих других языках, например, js, php, ruby, java, а там где нет необходимо будет написать такую функцию, которая на вход принимает строку, а на выходе дает результат число).
4. Сравнение результата выполненной строки с ожидаемым, если подходит, то добавляем в массив допустимых строковых выражений.
5. Если мы задали часть строки, например, хотим видеть, чтобы в строке обяязательно было 3+2 или 9+8, то педе добавлением в массив допустимых строковых выражений смотрим, есть ли данная часть в текущем варианте, то есть добавляем еще 1 условий допустимости строкового выражения.


```python
import itertools

expectVal = 200
expectStr = '3+2'

digits = list(range(9, -1, -1))
ops = ['+', '-', '']
combos = itertools.product(ops, repeat = 9)

mayCombos = []

for combo in combos:
    # Склеиваем цифры и операции в строку
    expr = "".join(str(d) + o for d, o in zip(digits, combo)) + "0"
    # Вычисляем значение выражения
    value: int = eval(expr)
    # Если значение равно ожидаемому, выводим выражение и останавливаем цикл
    if value == expectVal:
        if expectStr == None or expectStr in expr:
            mayCombos.append(f'{expr} = {value}')

if len(mayCombos) > 0:
    print(mayCombos[0])
else:
    print('()')
```